org/notes/k8s.org
#+title:      Docker Kubernetes Notes
#+date:       2024-11-08 Fri 09:52
#+filetags:   :k8s:sap:
#+identifier: 20241108T095209

* Docker
A container is a standard unit of software that packages up code and all its dependencies so the application runs quickly and reliably from one computing environment to another. The Linux kernel does not know about containers at all – for it, containers are nothing more than just regular processes running on the system. It however offers several features that Docker and other container engines leverage to achieve an almost complete isolation of processes from each other. Some of them being
- Chroot : Changes the root directory for a process to any given directory, processes running in that chroot can only see those parts of the filesystem which are subdirectories of it
- Namespaces : Different processes see different environments even though they are on the same host/OS
- cgroups : manage/limit resource allocation to individual processes

When talking about a “container”, we are referring to the combination of read-only layers from the image and one read-write layer on top of it ([[https://iammathew.com/blog/understanding-docker-images/filesystem][overlayfs]]). You can derive/instantiate an indefinite number of containers from the same image. They only vary by the read-write layer on top. Or stated another way: A container consists of just the read-write layer, some meta data (settings, flags pass on start) and a reference to the image.

Creating a Docker image involves two things:
- A /Dockerfile/ containing directives on how the image is meant to be built
- A /build-context/ (or PATH) which is a directory on your hard disk; every file to be added to the image must be inside the build-context

Each line in a Dockerfile is executed in a temporary container which gets persisted as a new layer on top of the existing layers. Some directives to keep in mind are =FROM, ENV, LABEL, COPY, ADD, RUN, EXPOSE, CMD, ENTRYPOINT, USER=.

*Multistage builds* are another powerful feature of the container ecosystem. Typically, you do not want ship your build environment, but have a dedicated runtime environment. Multistage builds are an elegant way to separate these two things. The first stage is a build environment with a compiler or whatever is needed. The 2nd stage is much smaller in size/content (e.g. distroless) and should contain only those things needed to run the application. The stages are referred later on by specifying their names as =FROM <stage/image> AS <stage-name>=

* Kubernetes
:PROPERTIES:
:CUSTOM_ID: h:06603D16-4A5E-4AC0-8A9C-8C7F5EE20433
:END:
Kubernetes makes the core design decision that all configuration is declarative, and that all configuration is implemented by way of “operators” which function as control loops: They continually compare the desired configuration with the state of reality, and then attempt to take actions to bring reality in line with the desired state. ([[https://buttondown.com/nelhage/archive/two-reasons-kubernetes-is-so-complex][Ref]], [[https://cloud.google.com/kubernetes-engine/kubernetes-comic][A nice introductory comic]])

Kubernetes is just a container orchestrator. The central part remains our image, which contains the application we want to run. In the end Kubernetes runs lots and lots of containers – however in a smart way.

