docs/notes/k8s.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Docker Kubernetes Notes</title>
<meta name="author" content="Tak" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='/css/stylesheet.css'>
</head>
<body>
<div id="nav" class="status">
<a href='/'>bacchanalian madness</a> / <a href='/rss'>rss</a> / <label id='dark-mode-button'> <input type='checkbox'> </label>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Docker Kubernetes Notes</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgedcd2fc">Docker</a></li>
<li><a href="#h:06603D16-4A5E-4AC0-8A9C-8C7F5EE20433">Kubernetes</a></li>
<li><a href="#orge53ca97">Helm</a></li>
</ul>
</div>
</nav>
<div id="outline-container-orgedcd2fc" class="outline-2">
<h2 id="orgedcd2fc">Docker</h2>
<div class="outline-text-2" id="text-orgedcd2fc">
<p>A container is a standard unit of software that packages up code and all its dependencies so the application runs quickly and reliably from one computing environment to another. The Linux kernel does not know about containers at all – for it, containers are nothing more than just regular processes running on the system. It however offers several features that Docker and other container engines leverage to achieve an almost complete isolation of processes from each other. Some of them being
</p>
<ul class="org-ul">
<li>Chroot : Changes the root directory for a process to any given directory, processes running in that chroot can only see those parts of the filesystem which are subdirectories of it</li>
<li>Namespaces : Different processes see different environments even though they are on the same host/OS</li>
<li>cgroups : manage/limit resource allocation to individual processes</li>
</ul>

<p>When talking about a “container”, we are referring to the combination of read-only layers from the image and one read-write layer on top of it (<a href="https://iammathew.com/blog/understanding-docker-images/filesystem">overlayfs</a>). You can derive/instantiate an indefinite number of containers from the same image. They only vary by the read-write layer on top. Or stated another way: A container consists of just the read-write layer, some meta data (settings, flags pass on start) and a reference to the image.
</p>

<p>Creating a Docker image involves two things:
</p>
<ul class="org-ul">
<li>A <i>Dockerfile</i> containing directives on how the image is meant to be built</li>
<li>A <i>build-context</i> (or PATH) which is a directory on your hard disk; every file to be added to the image must be inside the build-context</li>
</ul>

<p>Each line in a Dockerfile is executed in a temporary container which gets persisted as a new layer on top of the existing layers. Some directives to keep in mind are <code>FROM, ENV, LABEL, COPY, ADD, RUN, EXPOSE, CMD, ENTRYPOINT, USER</code>.
</p>

<p><b>Multistage builds</b> are another powerful feature of the container ecosystem. Typically, you do not want ship your build environment, but have a dedicated runtime environment. Multistage builds are an elegant way to separate these two things. The first stage is a build environment with a compiler or whatever is needed. The 2nd stage is much smaller in size/content (e.g. distroless) and should contain only those things needed to run the application. The stages are referred later on by specifying their names as <code>FROM &lt;stage/image&gt; AS &lt;stage-name&gt;</code>
</p>
</div>
</div>
<div id="outline-container-h:06603D16-4A5E-4AC0-8A9C-8C7F5EE20433" class="outline-2">
<h2 id="h:06603D16-4A5E-4AC0-8A9C-8C7F5EE20433">Kubernetes</h2>
<div class="outline-text-2" id="text-h:06603D16-4A5E-4AC0-8A9C-8C7F5EE20433">
<p>Kubernetes makes the core design decision that all configuration is declarative, and that all configuration is implemented by way of “operators” which function as control loops: They continually compare the desired configuration with the state of reality, and then attempt to take actions to bring reality in line with the desired state. (<a href="https://buttondown.com/nelhage/archive/two-reasons-kubernetes-is-so-complex">Ref</a>, <a href="https://cloud.google.com/kubernetes-engine/kubernetes-comic">A nice introductory comic</a>)
</p>

<p>Kubernetes is just a container orchestrator. The central part remains our image, which contains the application we want to run. In the end Kubernetes runs lots and lots of containers – however in a smart way.
</p>
</div>
