org/notes/k8s.org
** Building blocks
Kubernetes doesn’t allow you to schedule individual containers, it wraps the container into something called a /pod/ – which can be considered as a logical host with one or more containers that share storage and network resources. Put another way, a Kubernetes Pod is a set of containers that perform an interrelated function and that operate as part of the same workload.

Containers in a pod share storage/network interface. Usually its one or two containers per pod, following the [[https://labs.iximiuz.com/tutorials/kubernetes-native-sidecars][sidecar]] (2nd container provides augmentation to improve the application container) or adapter (provides abstraction to entities outside of pod) pattern. ([[https://labs.iximiuz.com/tutorials/containers-vs-pods][Containers vs Pods]])

Although you could add all the containers for your application into the same Pod, it is a good practice to have one container per Pod. Then, group all the Pods that conform one application into a Namespace.

A Kubernetes node is a physical or virtual machine that operates as part of a Kubernetes cluster. Pods can run on nodes, but the purpose of a node is to provide host infrastructure, not define and deploy applications. Pods do the latter. Thus, while Pods are the fundamental building blocks of Kubernetes workloads, nodes are the fundamental building blocks of Kubernetes infrastructure.

While deploying a pod manually works, it doesn’t allow to scale nor to run reliably. With /deployments/ etc we get different constructs allowing to run one to many pods with different characteristics.

The networking entities provide cluster internal as well as external connectivity. /Policies/ provide a runtime security context on networking as well as container level. Resources have also an API representation – you can get information about nodes and manage consumption per pod etc.

You don’t want to know and manage individual pods. You would like to specify a template and instantiate it as often as you wish. Also you want to manage the group of pods e.g. in terms of docker image used. The *deployment* gives you these management capabilities. In it’s resource description (yaml file) you specify a pod template, how pods should be labeled and of course a corresponding selector to identify your pods. The deployment creates and manages a replicaSet which in turn manages the pods.

Further details: 
- DaemonSet: Ensures that all (or explicitly specified) nodes run a copy of a pod. They ensure that a pod is replicated on some or all of the nodes. When a new node is added to a Kubernetes cluster, a new pod will be created on that node. For example a kube-proxy can run as a pod on every node managed by a daemonSet. A daemonset works almost similar to a deployment. However the replica count is determined by the number of cluster nodes.
- StatefulSet: Manages the deployment and scaling of a set of pods, and *provides guarantees about the ordering and uniqueness* of these pods. Deployments are like running identical workers at a factory (completely interchangeable), while StatefulSets are like running a team where each person has their own specific role and resources (not interchangeable). Similar to deployments, but it provides /more stability/ with regards to names/identifiers. Service routes traffic to a *specific* pod based on labels and *names* and pods have stable names, individual persistent storage and are ordered unlike in the case of deployments.
- Headless Service: Allows you to connect directly to a pod while using dns names instead of IP addresses. A headless service is created, by specifying “None” as the value for “ClusterIP”. They are needed to make StatefulSets work.
- [[https://sysdig.com/learn-cloud-native/kubernetes-replicasets-overview/][ReplicaSet]]: Kubernetes object used to maintain a stable set of replicated pods running within a cluster at any given time. Deployments are an alternative to ReplicaSets,  as they are used to manage ReplicaSets . They are handy when it comes to rolling out changes to a set of pods via a ReplicaSet. You can simply roll back to a previous Deployment revision when managing a ReplicaSet using a Deployment or create a new revision.
- Resource Quotas: Set quotas on namespace level, limit the number of resources (Pod, PVC, Service…) allowed in this namespace. Can also enforce applications to specify minimal resources required and max resources (limit) wanted.
- Roles: a role defines a setup of API objects that can be accessed in a certain way. For example, a role can allow only list/read access to pods. Another role could also allow to list/read, create & delete pods
- Role Bindings: assign roles to service accounts /technical users ([[https://sysdig.com/learn-cloud-native/kubernetes-rbac-explained/][rbac explained]])

Reconciliation consists of three stages - "Observe, Analyze, Act"
1. Observe: Control loop watches API for changes
2. Analyze: Check current state against the desired, look for any deltas
3. Act: If there is a delta, controller should act and trigger a defined action to bring the observed objects into desired state

GVK: Groups are a collection of related functionality, versions are specific implementations and kinds are types. Namespaces group a set of resources.
=/api/<version>/= or =/apis/<g>/<v>/namespaces/<name>/=

