docs/notes/k8s.html
<div id="outline-container-org98395a3" class="outline-3">
<h3 id="org98395a3">Building blocks</h3>
<div class="outline-text-3" id="text-org98395a3">
<p>Kubernetes doesn’t allow you to schedule individual containers, it wraps the container into something called a <i>pod</i> – which can be considered as a logical host with one or more containers that share storage and network resources. Put another way, a Kubernetes Pod is a set of containers that perform an interrelated function and that operate as part of the same workload.
</p>

<p>Containers in a pod share storage/network interface. Usually its one or two containers per pod, following the <a href="https://labs.iximiuz.com/tutorials/kubernetes-native-sidecars">sidecar</a> (2nd container provides augmentation to improve the application container) or adapter (provides abstraction to entities outside of pod) pattern. (<a href="https://labs.iximiuz.com/tutorials/containers-vs-pods">Containers vs Pods</a>)
</p>

<p>Although you could add all the containers for your application into the same Pod, it is a good practice to have one container per Pod. Then, group all the Pods that conform one application into a Namespace.
</p>

<p>A Kubernetes node is a physical or virtual machine that operates as part of a Kubernetes cluster. Pods can run on nodes, but the purpose of a node is to provide host infrastructure, not define and deploy applications. Pods do the latter. Thus, while Pods are the fundamental building blocks of Kubernetes workloads, nodes are the fundamental building blocks of Kubernetes infrastructure.
</p>

<p>While deploying a pod manually works, it doesn’t allow to scale nor to run reliably. With <i>deployments</i> etc we get different constructs allowing to run one to many pods with different characteristics.
</p>

<p>The networking entities provide cluster internal as well as external connectivity. <i>Policies</i> provide a runtime security context on networking as well as container level. Resources have also an API representation – you can get information about nodes and manage consumption per pod etc.
</p>

<p>You don’t want to know and manage individual pods. You would like to specify a template and instantiate it as often as you wish. Also you want to manage the group of pods e.g. in terms of docker image used. The <b>deployment</b> gives you these management capabilities. In it’s resource description (yaml file) you specify a pod template, how pods should be labeled and of course a corresponding selector to identify your pods. The deployment creates and manages a replicaSet which in turn manages the pods.
</p>

<p>Further details: 
</p>
<ul class="org-ul">
<li>DaemonSet: Ensures that all (or explicitly specified) nodes run a copy of a pod. They ensure that a pod is replicated on some or all of the nodes. When a new node is added to a Kubernetes cluster, a new pod will be created on that node. For example a kube-proxy can run as a pod on every node managed by a daemonSet. A daemonset works almost similar to a deployment. However the replica count is determined by the number of cluster nodes.</li>
<li>StatefulSet: Manages the deployment and scaling of a set of pods, and <b>provides guarantees about the ordering and uniqueness</b> of these pods. Deployments are like running identical workers at a factory (completely interchangeable), while StatefulSets are like running a team where each person has their own specific role and resources (not interchangeable).Similar to deployments, however it provides <i>more stability</i> with regards to names/identifiers. Service routes traffic to a <b>specific</b> pod based on labels and <b>names</b> and pods have stable names, individual persistent storage and are ordered unlike in the case of deployments.</li>
<li>Headless Service: Allows you to connect directly to a pod while using dns names instead of IP addresses. A headless service is created, by specifying “None” as the value for “ClusterIP”. They are needed to make StatefulSets work.</li>
<li><a href="https://sysdig.com/learn-cloud-native/kubernetes-replicasets-overview/">ReplicaSet</a>: Kubernetes object used to maintain a stable set of replicated pods running within a cluster at any given time. Deployments are an alternative to ReplicaSets,  as they are used to manage ReplicaSets . They are handy when it comes to rolling out changes to a set of pods via a ReplicaSet. You can simply roll back to a previous Deployment revision when managing a ReplicaSet using a Deployment or create a new revision.</li>
<li>Resource Quotas: Set quotas on namespace level, limit the number of resources (Pod, PVC, Service…) allowed in this namespace. Can also enforce applications to specify minimal resources required and max resources (limit) wanted.</li>
<li>Roles: a role defines a setup of API objects that can be accessed in a certain way. For example, a role can allow only list/read access to pods. Another role could also allow to list/read, create &amp; delete pods</li>
<li>Role Bindings: assign roles to service accounts /technical users (<a href="https://sysdig.com/learn-cloud-native/kubernetes-rbac-explained/">rbac explained</a>)</li>
</ul>

<p>Reconciliation consists of three stages - "Observe, Analyze, Act"
</p>
<ol class="org-ol">
<li>Observe: Control loop watches API for changes</li>
<li>Analyze: Check current state against the desired, look for any deltas</li>
<li>Act: If there is a delta, controller should act and trigger a defined action to bring the observed objects into desired state</li>
</ol>

<p>GVK: Groups are a collection of related functionality, versions are specific implementations and kinds are types. Namespaces group a set of resources.
<code>/api/&lt;version&gt;/</code> or <code>/apis/&lt;g&gt;/&lt;v&gt;/namespaces/&lt;name&gt;/</code>
</p>
</div>
</div>
