org/notes/k8s.org
** Communication
Communication between pods requires something called as a "service", it's not sensible to rely on IP addresses for pods are they can change if a pod dies/restarts. Services act as a reliable and stable endpoint that provides cluster-internal and external connectivity. Services determine their managed pods by labels and corresponding selectors. Kubernetes also offers a way to name any port on a container/service level which can then be used as a reference even if the port value changes over time without impacting the application. ([[https://sysdig.com/learn-cloud-native/what-is-kubernetes-networking/][k8s networking]])

To expose a service to the outside world (outside of cluster scoped DNS/IP range), we can use NodePorts or LoadBalancer. The types of services available are:
1. Cluster IP
2. LoadBalancer: A single network endpoint with a unique IP which will be associated with a service. Incoming traffic to this IP on the service port will be forwarded through the service to the pods matching the labels specified in the service description.
3. NodePort: A port that is opened on every node of the cluster. It is associated with a service and any incoming traffic at this nodePort will be routed to the corresponding service. From there it will be forwarded to service’s pods, regardless on which node it they actually run.

Ingress exposes HTTP and HTTPS routes from outside the cluster to services within the cluster. Only creating an Ingress resource has no effect. You may need to deploy an Ingress controller such as ingress-nginx. Ingress controller is typically exposed via a LoadBalancer service and it handles traffic according to ingress specifications.

The easiest way of using an Ingress is as an entry point to a single service with one to multiple pods. The ingress is created for a dedicated URL. From the services' perspective everything works as usual. A port and a target port are specified and base on labels and selectors the traffic is routed. Rules define forwarding of incoming traffic to backends. In this case traffic is sent to a service.

[[https://kubernetes.io/docs/concepts/services-networking/ingress/#types-of-ingress][Types of ingress]]:
1. An Ingress with no rules sends all traffic to a single default backend and =.spec.defaultBackend= is the backend that should handle requests in that case.
2. A fanout configuration routes traffic from a single IP address to more than one Service, based on the HTTP URI being requested.
   #+begin_src yaml
spec:
  rules:
    - host: foo.bar.com
      http:
        paths:
        - path: /foo
          pathType: Prefix
          backend:
            service:
              name: service1
        - path: /bar
          pathType: Prefix
          backend:
            service:
              name: service2
   #+end_src
3. Name-based virtual hosts support routing HTTP traffic to multiple host names at the same IP address.
   #+begin_src yaml
spec:
  rules:
    - host: foo.bar.com # foo bar
      http:
        paths:
        - path: "/"
          pathType: Prefix
          backend:
            service:
              name: service1
    - host: bar.foo.com # bar foo
      http:
        paths:
        - path: "/"
          pathType: Prefix
          backend:
            service:
              name: service2
   #+end_src

** Persistence
Pods can die/restart unexpectedly and lose all the data that's local to them, to solve the problem of persistence kubernetes offers PV/PVCs. A PersistentVolume (PV) is a piece of storage in the cluster that has been provisioned by an administrator having a lifecycle independent of the pods using the PV. A PersistentVolumeClaim (PVC) is a request for a storage by a user.

Claims can request specific sizes and access modes and claims bind pod storage to PVs. PV size must match or exceed PVC requested size. Due to the PV-PVC bind mechanism, it might happen that storage is claimed by the “wrong” requests. /Storage classes/ overcome this issue of manually provisioning PV by reversing the order. Firstly create a PVC and the storage class provides a fitting PV.

CSI – Container Storage Interface:
1. User requests a PVC
2. =StorageClass= is triggered to provision a PV
3. PV is backed by a physical volume, which is made available via the container storage interface.
   
Upon deletion of the claim object, PV becomes "unbound", then it can either be retained, deleted or recycled (deprecated). The access modes a PVC can specify are =RWO= (ReadWriteOnce) where a single node can mount a PVC at a time but if multiple pods are running on the same node they can all access it for restricting that to a single Pod use =RWOP= (ReadWriteOncePod). There's also =ROX= (ReadOnlyMany) and =RWX= (ReadWriteMany) where the volumes can be mounted as specified by many nodes.

** Additional Setup
An application container certainly needs configuration. However, adding this information to the container image is not feasible at all. Instead, we need a way through the Kubernetes API to reach our goal of dynamically injecting configuration, this is where ConfigMaps and Secrets come in. They separate configuration & credentials from the application and the required configuration data can be stored in specific data objects in etcd.

Configmaps and [[https://sysdig.com/learn-cloud-native/how-to-create-and-use-kubernetes-secrets/][secrets]] are based on key-value pairs. Allowed values are string or binary data. When using binary data, =base64 encoding= of the binary is mandatory. The contents of both can be project to environment variables of a container or mounted to the container file system via the volumes API.

The secrets can be used like any other volume and bound to the pod. When mounted into the filesystem the content/values are decoded and available in plain text so it's advised to set proper file permissions for them. There are 3 different types of secrets:
1. generic: to store credentials like passwords. Include as env variables or mount files
2. TLS: store certificates to setup TLS e.g. with a webserver
3. Docker-registry: Contains credentials to authenticate pulls from protected registry like the docker store or a private registry. Assign the secret as “imagePullSecret” to a pod, to use the credentials for image pulling for this pod. 

* Helm
Ref: [[https://sysdig.com/learn-cloud-native/what-is-helm-in-kubernetes/][What is helm]]
