docs/notes/k8s.html
<div id="outline-container-orgee64daf" class="outline-3">
<h3 id="orgee64daf">Communication</h3>
<div class="outline-text-3" id="text-orgee64daf">
<p>Communication between pods requires something called as a "service", it's not sensible to rely on IP addresses for pods are they can change if a pod dies/restarts. Services act as a reliable and stable endpoint that provides cluster-internal and external connectivity. Services determine their managed pods by labels and corresponding selectors. Kubernetes also offers a way to name any port on a container/service level which can then be used as a reference even if the port value changes over time without impacting the application. (<a href="https://sysdig.com/learn-cloud-native/what-is-kubernetes-networking/">k8s networking</a>)
</p>

<p>To expose a service to the outside world (outside of cluster scoped DNS/IP range), we can use NodePorts or LoadBalancer. The types of services available are:
</p>
<ol class="org-ol">
<li>Cluster IP</li>
<li>LoadBalancer: A single network endpoint with a unique IP which will be associated with a service. Incoming traffic to this IP on the service port will be forwarded through the service to the pods matching the labels specified in the service description.</li>
<li>NodePort: A port that is opened on every node of the cluster. It is associated with a service and any incoming traffic at this nodePort will be routed to the corresponding service. From there it will be forwarded to service’s pods, regardless on which node it they actually run.</li>
</ol>

<p>Ingress exposes HTTP and HTTPS routes from outside the cluster to services within the cluster. Only creating an Ingress resource has no effect. You may need to deploy an Ingress controller such as ingress-nginx. Ingress controller is typically exposed via a LoadBalancer service and it handles traffic according to ingress specifications.
</p>

<p>The easiest way of using an Ingress is as an entry point to a single service with one to multiple pods. The ingress is created for a dedicated URL. From the services' perspective everything works as usual. A port and a target port are specified and base on labels and selectors the traffic is routed. Rules define forwarding of incoming traffic to backends. In this case traffic is sent to a service.
</p>

<p><a href="https://kubernetes.io/docs/concepts/services-networking/ingress/#types-of-ingress">Types of ingress</a>:
</p>
<ol class="org-ol">
<li>An Ingress with no rules sends all traffic to a single default backend and <code>.spec.defaultBackend</code> is the backend that should handle requests in that case.</li>
<li><p>A fanout configuration routes traffic from a single IP address to more than one Service, based on the HTTP URI being requested.
</p>
<pre class="src src-yaml"><code>   spec:
     rules:
       - host: foo.bar.com
         http:
           paths:
           - path: /foo
             pathType: Prefix
             backend:
               service:
                 name: service1
           - path: /bar
             pathType: Prefix
             backend:
               service:
                 name: service2</code></pre></li>
<li><p>Name-based virtual hosts support routing HTTP traffic to multiple host names at the same IP address.
</p>
<pre class="src src-yaml"><code>   spec:
     rules:
       - host: foo.bar.com # foo bar
         http:
           paths:
           - path: "/"
             pathType: Prefix
             backend:
               service:
                 name: service1
       - host: bar.foo.com # bar foo
         http:
           paths:
           - path: "/"
             pathType: Prefix
             backend:
               service:
                 name: service2</code></pre></li>
</ol>
</div>
</div>
<div id="outline-container-org7894faf" class="outline-3">
<h3 id="org7894faf">Persistence</h3>
<div class="outline-text-3" id="text-org7894faf">
<p>Pods can die/restart unexpectedly and lose all the data that's local to them, to solve the problem of persistence kubernetes offers PV/PVCs. A PersistentVolume (PV) is a piece of storage in the cluster that has been provisioned by an administrator having a lifecycle independent of the pods using the PV. A PersistentVolumeClaim (PVC) is a request for a storage by a user.
</p>

<p>Claims can request specific sizes and access modes and claims bind pod storage to PVs. PV size must match or exceed PVC requested size. Due to the PV-PVC bind mechanism, it might happen that storage is claimed by the “wrong” requests. <i>Storage classes</i> overcome this issue of manually provisioning PV by reversing the order. Firstly create a PVC and the storage class provides a fitting PV.
</p>

<p>CSI – Container Storage Interface:
</p>
<ol class="org-ol">
<li>User requests a PVC</li>
<li><code>StorageClass</code> is triggered to provision a PV</li>
<li>PV is backed by a physical volume, which is made available via the container storage interface.</li>
</ol>

<p>Upon deletion of the claim object, PV becomes "unbound", then it can either be retained, deleted or recycled (deprecated). The access modes a PVC can specify are <code>RWO</code> (ReadWriteOnce) where a single node can mount a PVC at a time but if multiple pods are running on the same node they can all access it for restricting that to a single Pod use <code>RWOP</code> (ReadWriteOncePod). There's also <code>ROX</code> (ReadOnlyMany) and <code>RWX</code> (ReadWriteMany) where the volumes can be mounted as specified by many nodes.
</p>
</div>
</div>
<div id="outline-container-org30cbe3f" class="outline-3">
<h3 id="org30cbe3f">Additional Setup</h3>
<div class="outline-text-3" id="text-org30cbe3f">
<p>An application container certainly needs configuration. However, adding this information to the container image is not feasible at all. Instead, we need a way through the Kubernetes API to reach our goal of dynamically injecting configuration, this is where ConfigMaps and Secrets come in. They separate configuration &amp; credentials from the application and the required configuration data can be stored in specific data objects in etcd.
</p>

<p>Configmaps and <a href="https://sysdig.com/learn-cloud-native/how-to-create-and-use-kubernetes-secrets/">secrets</a> are based on key-value pairs. Allowed values are string or binary data. When using binary data, <code>base64 encoding</code> of the binary is mandatory. The contents of both can be project to environment variables of a container or mounted to the container file system via the volumes API.
</p>

<p>The secrets can be used like any other volume and bound to the pod. When mounted into the filesystem the content/values are decoded and available in plain text so it's advised to set proper file permissions for them. There are 3 different types of secrets:
</p>
<ol class="org-ol">
<li>generic: to store credentials like passwords. Include as env variables or mount files</li>
<li>TLS: store certificates to setup TLS e.g. with a webserver</li>
<li>Docker-registry: Contains credentials to authenticate pulls from protected registry like the docker store or a private registry. Assign the secret as “imagePullSecret” to a pod, to use the credentials for image pulling for this pod.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orge53ca97" class="outline-2">
<h2 id="orge53ca97">Helm</h2>
<div class="outline-text-2" id="text-orge53ca97">
<p>Ref: <a href="https://sysdig.com/learn-cloud-native/what-is-helm-in-kubernetes/">What is helm</a>
</p>
</div>
</div>
</div>
<footer id="postamble" class="status">
&copy; 2026 . Made with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 31.0.50 (<a href="https://orgmode.org">Org</a> mode 9.7.11).
</footer>
</body>
</html>
